export const th = {
  core: {
    Code: "th",
    AddGrow: "เพิ่มการปลูกใหม่",
    Back: "กลับ",
    Cancel: "ยกเลิก",
    Delete: "ลบ",
    DateStart: "วันที่เริ่มต้น",
    Age: "อายุ",
    Phase: "ระยะ",
    Days: "วัน",
    Date: "วันที่",
    FormName: "ชื่อ",
    FlowerTi: "ระยะเวลาออกดอก",
    Current: "ระยะปัจจุบัน",
    PhaseDur: "ระยะเวลาในแต่ละช่วง",
    Tap: "แตะที่นี่",
    Confirm: "ยืนยัน",
    Create: "สร้าง",
    Edit: "แก้ไข",
    Name: "ชื่อ",
    Loading: "กำลังโหลด...",
    Language: "ภาษา",
    Theme: "ธีม",
    DeleteData: "ลบฐานข้อมูล",
    Clear: "ลบข้อมูลทั้งหมด",
    DateStarted: "วันที่เริ่มการปลูก",
    DeleteRecords: "คุณแน่ใจหรือไม่ว่าต้องการลบข้อมูลทั้งหมด?",
    DeleteGrow: "คุณแน่ใจหรือไม่ว่าต้องการลบการปลูกนี้?",
    Adproblem: "เกิดปัญหาขึ้น",
    NewGrow: "บันทึกการปลูกใหม่แล้ว",
    EnterDuration: "กรุณาใส่ระยะเวลา",
    EnterFlower: "กรุณาใส่ระยะเวลาออกดอก",
    EnterName: "กรุณาใส่ชื่อ",
    Changes: "บันทึกการเปลี่ยนแปลงแล้ว",
     SaveChange:"บันทึกการเปลี่ยนแปลง",
     Developer:"นักพัฒนา",
     Email: "อีเมล",
     Hide:"ซ่อน",
     Show:"แสดง",
     Dark:"โหมดมืด",
     Light:"โหมดสว่าง",
     RemoveAds:"ลบโฆษณา",
     Upgrade:"อัปเกรด",
     Support:"สนับสนุนและข้อสงสัย",
     DateCreated:"วันที่สร้าง",
    FlowerDate:"วันที่ออกดอก" ,
    TotalAge:"อายุรวม",

    Upgrade: "อัปเกรด",
    RemoveAds: "ลบโฆษณา",
    AdFreeTier: "ลบโฆษณาทั้งหมด",
    MediumTier: "บันทึกการปลูกได้สูงสุด 5 รายการ",
    UnlimitedTier: "บันทึกการปลูกได้ไม่จำกัด",
    EstDryTime: "เวลาที่คาดว่าจะตากแห้ง",
    FloweringTimePhase: "ระยะเวลาในช่วงออกดอก",
    VeggingTimePhase: "ระยะเวลาในช่วงการเจริญเติบโต",
    TotalVeggingTime: "ระยะเวลาการเจริญเติบโตที่คาดไว้ทั้งหมด",
    DryingDuration: "ระยะเวลาตากแห้ง",
    GrowUpdated: "การปลูกได้รับการอัปเดต",
    GrowRemoved: "การปลูกถูกลบออก",
    ChangePhase: "เปลี่ยนช่วง",
    AllGrowsGone: "การปลูกทั้งหมดถูกลบ",
    Error: "ข้อผิดพลาด!",
    UpgradeTo2: "อัปเกรดเพื่อสร้างการปลูกได้มากกว่า 2 รายการ",
    UpgradeTo5: "อัปเกรดเพื่อสร้างการปลูกได้มากกว่า 5 รายการ",

    PurchaseSuccess:"ซื้อสำเร็จ! ขอบคุณ!",
    PurcaseFail:"การซื้อไม่สำเร็จ",
    AdFree: "ระดับไม่มีโฆษณา",
    Grows5: "ระดับปลูกได้ 5 ครั้ง",
    Unlimited: "ระดับปลูกได้ไม่จำกัด",
    DateStarted: "วันที่เริ่มต้น",
    PhaseLast: "ช่วงเวลาที่เปลี่ยนแปลงครั้งล่าสุด",
    Status:"สถานะ",ScrollDown:"เลื่อนลง",Week:"สัปดาห์",
    TestMode: "โหมดทดสอบ",
    
    DeveloperMode: "โหมดนักพัฒนา",
    Tester: "ผู้ทดสอบ",
    Developer: "นักพัฒนา",
    EntitlementLvl: "ระดับสิทธิ์:",
    ThanksTester: "ขอบคุณสำหรับการเป็นผู้ทดสอบ"
},

tiers:{
  Free:"ชั้นฟรี	",
  AdFree:"ชั้นไม่มีโฆษณา",
  Grows5:"ชั้นปลูก 5 ครั้ง",
  Unlimited:"ชั้นไม่จำกัด"
},


languages: [
  {key: 'en', label: 'อังกฤษ'},
  {key: 'th', label: 'ไทย'},
  {key: 'fr', label: 'ฝรั่งเศส'},
  {key: 'hbr', label: 'ฮิบรู'},
  {key: 'hi', label: 'ฮินดู'},
  {key: 'spn', label: 'สเปน'},
  {key: 'de', label: 'เยอรมัน'},
  {key: 'it', label: 'อิตาลี'},
],
languageChoice: {
  'en': 'อังกฤษ',
  'th': 'ไทย',
  'fr': 'ฝรั่งเศส',
  'hbr': 'ฮิบรู',
  'hi': 'ฮินดู',
  'spn': 'สเปน',
  'de': 'เยอรมัน',
  'it': 'อิตาลี',
},
phase:{
  "In Veg":"ในระยะเติบโต",
  "In Flower": "ในระยะออกดอก",
  "Drying": "กำลังตากแห้ง",
    data:[
      { key: "In Veg", label: "ในระยะเติบโต" }, // "In Veg"
      { key: "In Flower", label: "ในระยะออกดอก" }, // "In Flower"
      { key: "Drying", label: "กำลังตากแห้ง" }  // "Hanging"
  ]
},
theme:{
  data:[
    { key: 'light', label: 'โหมดสว่าง' }, // "Light-Mode"
    { key: 'dark', label: 'โหมดมืด' }    // "Dark-Mode"
]
},
menuList:[
  {
      Id: 'grows',
      Title: "การปลูก",
      Description: [
          "บันทึกวันที่สำคัญ",
          "ติดตามแต่ละระยะ",
          "แก้ไขและลบข้อมูล"
      ]
  },
  {
      Id: 'calculator',
      Title: "เครื่องคำนวณ",
      Description: [
          "คำนวณปริมาณน้ำและสารอาหาร",
          "ปริมาณ CO2 และแสงสว่าง",
          "ประมาณการผลผลิต"
      ]
  },
  {
      Id: 'settings',
      Title: "การตั้งค่า",
      Description: [
          "ตั้งค่าภาษา",
          "เลือกธีม",
          "ล้างฐานข้อมูล"
      ]
  }
],
calculators: {
  calculatorDescriptions: {
    Co2: "คำนวณอัตราการเติมก๊าซ CO₂ ต่อชั่วโมงสำหรับการปลูกในร่ม",
    Yield: "เครื่องคำนวณผลผลิตเพื่อประมาณน้ำหนักการเก็บเกี่ยวตามวัตต์ เวจ และระยะเวลาออกดอก",
    Light: "เครื่องคำนวณแสงเพื่อประมาณกำลังไฟที่ต้องการตามขนาดพื้นที่ปลูก",
    Water: "เครื่องคำนวณการใช้น้ำเพื่อประมาณการใช้น้ำและสารอาหารตามอายุพืชและรอบการปลูก",
    Elec: "เครื่องคำนวณการใช้ไฟฟ้าเพื่อประมาณค่าไฟตามวัตต์ เวลาใช้งาน และอัตราค่าไฟ",
  },
      calculators: {
        CalculateCO2: 'คำนวณ CO2 ที่ต้องการ',
        EnterRate: 'ป้อนอัตรา',
        GwH: 'ความสูงจากพื้น (ม.)',
        GwL: 'ความยาวพื้นที่ปลูก (ม.)',
        GwW: 'ความกว้างพื้นที่ปลูก (ม.)',
        EnterHeight: 'ป้อนความสูง',
        EnterLength: 'ป้อนความยาว',
        EnterWidth: 'ป้อนความกว้าง',
        Calc: 'คำนวณ',
        EnterFlowerAmount: 'ป้อนปริมาณสารอาหารสำหรับดอก',
        EnterNutrientAmount: 'ป้อนปริมาณสารอาหารสำหรับการเติบโต',
        EnterNumber: 'ป้อนจำนวนพืช',
        EnterAge: 'ป้อนอายุพืช',
        EnterWattage: 'ป้อนกำลังวัตต์',
        EnterWeeks: 'ป้อนจำนวนสัปดาห์ในช่วงการเติบโต',
        EnterDays: 'ป้อนจำนวนวันในช่วงออกดอก',
        HeaderText: 'เครื่องคิดเลข',
        Co2: 'เครื่องคิดเลข CO2',
        Final: 'เครื่องคิดเลขผลผลิตสุทธิ',
        Light: 'เครื่องคิดเลขการใช้แสง',
        Water: 'เครื่องคิดเลขการใช้น้ำ',
        ElecCalc: 'เครื่องคิดเลขค่าไฟฟ้า',
        elec: {
          Watts: 'วัตต์',
          Day: 'วันในระหว่างออกดอก',
          Week: 'สัปดาห์ในระหว่างเจริญเติบโต',
          Rate: 'อัตรา (กิโลวัตต์ต่อชั่วโมง)',
          Button: 'คำนวณค่าไฟฟ้า',
          Answer: 'คำตอบ',
        },
        light: {
          Width: 'ความกว้าง (เมตร)',
          Length: 'ความยาว (เมตร)',
          Height: 'ความสูงจากพื้น (เมตร)',
          Est: 'พลังงานไฟฟ้าโดยประมาณ',
          Watts: 'วัตต์',
        },
        co2: {
          EnvLength: 'ความยาวของสภาพแวดล้อม (เมตร)',
          EnvWidth: 'ความกว้างของสภาพแวดล้อม (เมตร)',
          EnvHeight: 'ความสูงของสภาพแวดล้อม (เมตร)',
          Button: 'คำนวณ CO2 ที่ต้องการ',
          Result: 'CO2 ที่ต้องการ',
          Ppm: 'ppm',
        },
        yield: {
          Wattage: 'พลังงานไฟฟ้า',
          VegWeeks: 'สัปดาห์ในระหว่างการเจริญเติบโต',
          FlowerDays: 'วันในระหว่างการออกดอก',
          Button: 'คำนวณผลผลิตสุทธิ',
          Est: 'ผลผลิตสุทธิโดยประมาณ',
          Grams: 'กรัม',
        },
        water: {
          TimeVeg: 'เวลาในการเจริญเติบโต (สัปดาห์)',
          TimeFl: 'เวลาในการออกดอก (วัน)',
          PlntAge: 'อายุพืชเมื่อเริ่มการเจริญเติบโต (วัน)',
          Number: 'จำนวนพืช',
          NuteVeg: 'สารอาหารต่อลิตรในช่วงการเจริญเติบโต (มล.)',
          NuteFlower: 'สารอาหารต่อลิตรในช่วงการออกดอก (มล.)',
          Button: 'คำนวณ',
          Est: 'ปริมาณน้ำที่ต้องการโดยประมาณ:',
          Liters: 'ลิตร',
          EstNuteVeg: 'สารอาหารที่ต้องการในช่วงการเจริญเติบโตโดยประมาณ',
          EstNuteFlower: 'สารอาหารที่ต้องการในช่วงการออกดอกโดยประมาณ',
          Ml: 'มล.',
        },
      },
    },

}
